ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/MCSPI0_CFG.xml
<module name="MCSPI0_CFG" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CFG_HL_REV" acronym="CFG_HL_REV" offset="0x0" width="32" description="IP Revision Identifier (X.Y.R)
Used by software to track features, bugs, and compatibility">
		<bitfield id="SCHEME" width="2" begin="31" end="30" resetval="0x1" description="Used to distinguish between old scheme and current" range="31 - 30" rwaccess="R"/> 
		<bitfield id="RSVD" width="2" begin="29" end="28" resetval="0x0" description="Reserved These bits are initialized to zero, and writes to them are ignored" range="29 - 28" rwaccess="R"/> 
		<bitfield id="FUNC" width="12" begin="27" end="16" resetval="0x48" description="Function indicates a software compatible module family If there is no level of software compatibility a new Func number [and hence REVISION] should be assigned" range="27 - 16" rwaccess="R"/> 
		<bitfield id="R_RTL" width="5" begin="15" end="11" resetval="0x3" description="RTL Version [R], maintained by IP design owner RTL follows a numbering such as XYRZ which are explained in this table R changes ONLY when: [1] PDS uploads occur which may have been due to spec changes [2] Bug fixes occur [3] Resets to '0' when X or Y changes Design team has an internal 'Z' [customer invisible] number which increments on every drop that happens due to DV and RTL updates Z resets to 0 when R increments" range="15 - 11" rwaccess="R"/> 
		<bitfield id="X_MAJOR" width="3" begin="10" end="8" resetval="0x2" description="Major Revision [X], maintained by IP specification owner X changes ONLY when: [1] There is a major feature addition An example would be adding Master Mode to Utopia Level2 The Func field [or Class/Type in old PID format] will remain the same X does NOT change due to: [1] Bug fixes [2] Change in feature parameters" range="10 - 8" rwaccess="R"/> 
		<bitfield id="CUSTOM" width="2" begin="7" end="6" resetval="0x0" description="Indicates a special version for a particular device Consequence of use may avoid use of standard Chip Support Library [CSL] / Drivers" range="7 - 6" rwaccess="R"/> 
		<bitfield id="Y_MINOR" width="6" begin="5" end="0" resetval="0x11" description="Minor Revision [Y], maintained by IP specification owner Y changes ONLY when: [1] Features are scaled [up or down] Flexibility exists in that this feature scalability may either be represented in the Y change or a specific register in the IP that indicates which features are exactly available [2] When feature creeps from Is-Not list to Is list But this may not be the case once it sees silicon; in which case X will change Y does NOT change due to: [1] Bug fixes [2] Typos or clarifications [3] major functional/feature change/addition/deletion Instead these changes may be reflected via R, S, X as applicable Spec owner maintains a customer-invisible number 'S' which changes due to: [1] Typos/clarifications [2] Bug documentation Note that this bug is not due to a spec change but due to implementation Nevertheless, the spec tracks the IP bugs An RTL release [say for silicon PG11] that occurs due to bug fix should document the corresponding spec number [XYS] in its release notes" range="5 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_HL_HWINFO" acronym="CFG_HL_HWINFO" offset="0x4" width="32" description="Information about the IP module's hardware configuration, i.e. typically the module's HDL generics (if any).
Actual field format and encoding is up to the module's designer to decide.">
		<bitfield id="RSVD" width="25" begin="31" end="7" resetval="0x0" description="Reserved These bits are initialized to zero, and writes to them are ignored" range="31 - 7" rwaccess="R"/> 
		<bitfield id="RETMODE" width="1" begin="6" end="6" resetval="0x0" description="This bit field indicates whether the retention mode is supported using the pin PIRFFRET" range="6" rwaccess="R"/> 
		<bitfield id="FFNBYTE" width="5" begin="5" end="1" resetval="0x4" description="FIFO number of byte generic parameter This register defines the value of FFNBYTE generic parameter, only MSB bits from 8 down to 4 are taken into account" range="5 - 1" rwaccess="R"/> 
		<bitfield id="USEFIFO" width="1" begin="0" end="0" resetval="0x1" description="Use of a FIFO enable: This bit field indicates if a FIFO is integrated within controller design with its management" range="0" rwaccess="R"/>
	</register>
	<register id="CFG_HL_SYSCONFIG" acronym="CFG_HL_SYSCONFIG" offset="0x10" width="32" description="Clock management configuration">
		<bitfield id="IDLEMODE" width="2" begin="3" end="2" resetval="0x2" description="Configuration of the local target state management mode By definition, target can handle read/write transaction as long as it is out of IDLE state" range="3 - 2" rwaccess="R/W"/> 
		<bitfield id="FREEEMU" width="1" begin="1" end="1" resetval="0x0" description="Sensitivity to emulation [debug] suspend input signal" range="1" rwaccess="R/W"/> 
		<bitfield id="SOFTRESET" width="1" begin="0" end="0" resetval="0x0" description="Software reset [Optional]" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_REVISION" acronym="CFG_REVISION" offset="0x100" width="32" description="This register contains the hard coded RTL revision number. ">
		<bitfield id="RESERVED_13" width="24" begin="31" end="8" resetval="0x0" description="Reads returns 0" range="31 - 8" rwaccess="R"/> 
		<bitfield id="REV" width="8" begin="7" end="0" resetval="0x43" description="IP revision [7:4] Major revision [3:0] Minor revision Examples: 0x10 for 10, 0x21 for 21" range="7 - 0" rwaccess="R"/>
	</register>
	<register id="CFG_SYSCONFIG" acronym="CFG_SYSCONFIG" offset="0x110" width="32" description="This register allows controlling various parameters of the OCP interface. ">
		<bitfield id="RESERVED_14" width="22" begin="31" end="10" resetval="0x0" description="Reads returns 0" range="31 - 10" rwaccess="R"/> 
		<bitfield id="CLOCKACTIVITY" width="2" begin="9" end="8" resetval="0x0" description="Clocks activity during wake up mode period" range="9 - 8" rwaccess="R/W"/> 
		<bitfield id="RESERVED_15" width="3" begin="7" end="5" resetval="0x0" description="Reads returns 0" range="7 - 5" rwaccess="R"/> 
		<bitfield id="SIDLEMODE" width="2" begin="4" end="3" resetval="0x2" description="Power management" range="4 - 3" rwaccess="R/W"/> 
		<bitfield id="ENAWAKEUP" width="1" begin="2" end="2" resetval="0x1" description="WakeUp feature control" range="2" rwaccess="R/W"/> 
		<bitfield id="SOFTRESET" width="1" begin="1" end="1" resetval="0x0" description="Software reset During reads it always returns 0" range="1" rwaccess="R/W"/> 
		<bitfield id="AUTOIDLE" width="1" begin="0" end="0" resetval="0x1" description="Internal OCP Clock gating strategy" range="0" rwaccess="R/W"/>
	</register>
	<register id="CFG_SYSSTATUS" acronym="CFG_SYSSTATUS" offset="0x114" width="32" description="This register provides status information about the module excluding the interrupt status information ">
		<bitfield id="RESERVED" width="31" begin="31" end="1" resetval="0x0" description="Reserved for module specific status information Read returns 0" range="31 - 1" rwaccess="N/A"/> 
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x1" description="Internal Reset Monitoring" range="0" rwaccess="R"/>
	</register>
	<register id="CFG_IRQSTATUS" acronym="CFG_IRQSTATUS" offset="0x118" width="32" description="The interrupt status regroups all the status of the module internal events that can generate an interrupt ">
		<bitfield id="RESERVED" width="14" begin="31" end="18" resetval="0x0" description="Reads returns 0" range="31 - 18" rwaccess="N/A"/> 
		<bitfield id="EOW" width="1" begin="17" end="17" resetval="0x0" description="End of word count event when a channel is enabled using the FIFO buffer and the channel had sent the number of SPI word defined by MCSPI_XFERLEVEL[WCNT] " range="17" rwaccess="R/W1TS"/> 
		<bitfield id="WKS" width="1" begin="16" end="16" resetval="0x0" description="Wake Up event in slave mode when an active control signal is detected on the SPIEN line programmed in the field MCSPI_CH0CONF[SPIENSLV] " range="16" rwaccess="R/W1TS"/> 
		<bitfield id="RESERVED" width="1" begin="15" end="15" resetval="0x0" description="Reads returns 0" range="15" rwaccess="N/A"/> 
		<bitfield id="RX3_FULL" width="1" begin="14" end="14" resetval="0x0" description="Receiver register is full or almost full Only when Channel 3 is enabled " range="14" rwaccess="R/W1TS"/> 
		<bitfield id="TX3_UNDERFLOW" width="1" begin="13" end="13" resetval="0x0" description="Transmitter register underflow Only when Channel 3 is enabled The transmitter register is empty [not updated by Host or DMA with new data] before its time slot assignment Exception: No TX_underflow event when no data has been loaded into the transmitter register since channel has been enabled " range="13" rwaccess="R/W1TS"/> 
		<bitfield id="TX3_EMPTY" width="1" begin="12" end="12" resetval="0x0" description="Transmitter register is empty or almost empty Note: Enabling the channel automatically rises this event " range="12" rwaccess="R/W1TS"/> 
		<bitfield id="RESERVED" width="1" begin="11" end="11" resetval="0x0" description="Reads returns 0" range="11" rwaccess="N/A"/> 
		<bitfield id="RX2_FULL" width="1" begin="10" end="10" resetval="0x0" description="Receiver register full or almost full Channel 2 " range="10" rwaccess="R/W1TS"/> 
		<bitfield id="TX2_UNDERFLOW" width="1" begin="9" end="9" resetval="0x0" description="Transmitter register underflow Channel 2 " range="9" rwaccess="R/W1TS"/> 
		<bitfield id="TX2_EMPTY" width="1" begin="8" end="8" resetval="0x0" description="Transmitter register empty or almost empty Channel 2 " range="8" rwaccess="R/W1TS"/> 
		<bitfield id="RESERVED" width="1" begin="7" end="7" resetval="0x0" description="Reads returns 0" range="7" rwaccess="N/A"/> 
		<bitfield id="RX1_FULL" width="1" begin="6" end="6" resetval="0x0" description="Receiver register full or almost full Channel 1 " range="6" rwaccess="R/W1TS"/> 
		<bitfield id="TX1_UNDERFLOW" width="1" begin="5" end="5" resetval="0x0" description="Transmitter register underflow Channel 1 " range="5" rwaccess="R/W1TS"/> 
		<bitfield id="TX1_EMPTY" width="1" begin="4" end="4" resetval="0x0" description="Transmitter register empty or almost empty Channel 1 " range="4" rwaccess="R/W1TS"/> 
		<bitfield id="RX0_OVERFLOW" width="1" begin="3" end="3" resetval="0x0" description="Receiver register overflow [slave mode only] Channel 0 " range="3" rwaccess="R/W1TS"/> 
		<bitfield id="RX0_FULL" width="1" begin="2" end="2" resetval="0x0" description="Receiver register full or almost full Channel 0 " range="2" rwaccess="R/W1TS"/> 
		<bitfield id="TX0_UNDERFLOW" width="1" begin="1" end="1" resetval="0x0" description="Transmitter register underflow Channel 0 " range="1" rwaccess="R/W1TS"/> 
		<bitfield id="TX0_EMPTY" width="1" begin="0" end="0" resetval="0x0" description="Transmitter register empty or almost empty Channel 0 " range="0" rwaccess="R/W1TS"/>
	</register>
